
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсвтаткиКнигНаПолках Приход
	Движения.ОсвтаткиКнигНаПолках.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьКниг Из ПереченьКниг Цикл
		Движение = Движения.ОсвтаткиКнигНаПолках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаПереченьКниг.Книга;
		Движение.Стелаж = ТекСтрокаПереченьКниг.Стелаж;
		Движение.Полка = ТекСтрокаПереченьКниг.Полка;
		Движение.Количество = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
