
&НаКлиенте
Процедура СписокКнигПолкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стелаж = Элементы.СписокКниг.ТекущиеДанные.Стелаж;
	
	СписокПолок = ПолучитьСписокПолок(Стелаж);
	
	Элемент.СписокВыбора.Очистить(); 
	Для Каждого Полка Из СписокПолок Цикл 
		Элемент.СписокВыбора.Добавить(Полка);
	КонецЦикла;

КонецПроцедуры


// Функция - Получает список полок из
//  выбранного Стелажа
//
// Параметры:
//  Стелаж - 	 -Справочник Стелажи 
// 
// Возвращаемое значение:
//  Результат -  список значений
//
&НаСервере
Функция ПолучитьСписокПолок(Стелаж)  
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтелажиПолки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Стелажи.Полки КАК СтелажиПолки
		|ГДЕ
		|	СтелажиПолки.Ссылка = &Стелаж";
	
	Запрос.УстановитьПараметр("Стелаж", Стелаж);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
  Возврат Результат;
КонецФункции 