
&НаКлиенте
Процедура СписокКнигПолкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стелаж = Элементы.СписокКниг.ТекущиеДанные.Стелаж;
	
	СписокПолок = ПолучитьСписокПолокССервера(Стелаж);
	Элемент.СписокВыбора.Очистить(); 
	Для Каждого Полка Из СписокПолок Цикл 
		Элемент.СписокВыбора.Добавить(Полка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПолокССервера(Стелаж)
	  Возврат ОбщегоНазначенияСервер.ПолучитьСписокПолок(Стелаж);
	КонецФункции 

&НаКлиенте
	Процедура ЧитательПриИзменении(Элемент)
	СписокКниг = ПолучитьСписокКнигУЧитателя(Объект.Читатель); 
	
	Если СписокКниг.Количество() > 0 Тогда 
		ДопПараметры = Новый Структура("СписокКниг", СписокКниг);
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеВопроса", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, "У клиента имеются книги на руках. 
		|Заполнить таблицу Автоматически?", Режим, 0);  
	КонецЕсли;

	КонецПроцедуры
	
	
// Функция - Получает список книг у читателя
//
// Параметры:
//  Читатель - 	Справочник.Читатели
// 
// Возвращаемое значение:
//  Массив со счписком книг
&НаСервере
Функция ПолучитьСписокКнигУЧитателя(Читатель)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КнигиНавРукахОстатки.Книга КАК Книга
		|ИЗ
		|	РегистрНакопления.КнигиНавРуках.Остатки(, Читатель = &Читатель) КАК КнигиНавРукахОстатки
		|ГДЕ
		|	КнигиНавРукахОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Читатель", Читатель);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Возврат РезультатЗапроса.ВыгрузитьКолонку("Книга");
		
	КонецФункции 	
	
	
&НаКлиенте
Процедура ПослеВопроса(Результат, ДопПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Нет Тогда   
		Возврат;
	КонецЕсли;
	
	Для каждого Книга Из ДопПараметры.СписокКниг Цикл
	
		  Объект.СписокКниг.Добавить().Книга = Книга;
	
		КонецЦикла;    
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не забудте указать стелаж и полку для книг";
		Сообщение.Сообщить();
	 
КонецПроцедуры // ПослеВопроса()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Объект.Сотрудник = ОбщегоНазначенияСервер.ПолучитьСотрудникаПоТекущемуПользователю();  
	КонецЕсли;
КонецПроцедуры
	