
// Функция - Получает список полок из
//  выбранного Стелажа
//
// Параметры:
//  Стелаж - 	 -Справочник Стелажи 
// 
// Возвращаемое значение:
//  Результат -  список значений
Функция ПолучитьСписокПолок(Стелаж) Экспорт  
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтелажиПолки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Стелажи.Полки КАК СтелажиПолки
		|ГДЕ
		|	СтелажиПолки.Ссылка = &Стелаж";
	
	Запрос.УстановитьПараметр("Стелаж", Стелаж);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
  Возврат Результат;
КонецФункции 

// Функция - Получает сотрудника по текущему пользователю
// 
// Возвращаемое значение:
//  Ссылка на сотрудника - Справочник.Сотрудники
//
Функция ПолучитьСотрудникаПоТекущемуПользователю () Экспорт
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	Иначе
		Справочники.Сотрудники.ПустаяСсылка(); 
	КонецЕсли;
	
	
КонецФункции 