
// Функция - Получает список полок из
//  выбранного Стелажа
//
// Параметры:
//  Стелаж - 	 -Справочник Стелажи 
// 
// Возвращаемое значение:
//  Результат -  список значений
Функция ПолучитьСписокПолок(Стелаж) Экспорт  
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтелажиПолки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Стелажи.Полки КАК СтелажиПолки
		|ГДЕ
		|	СтелажиПолки.Ссылка = &Стелаж";
	
	Запрос.УстановитьПараметр("Стелаж", Стелаж);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
  Возврат Результат;
КонецФункции 
