
Процедура ОбработкаПроведенияПервая(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсвтаткиКнигНаПолках Приход
	Движения.ОсвтаткиКнигНаПолках.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.ОсвтаткиКнигНаПолках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаСписокКниг.Книга;
		Движение.Стелаж = ТекСтрокаСписокКниг.Стелаж;
		Движение.Полка = ТекСтрокаСписокКниг.Полка;
		Движение.Количество = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КнигиНавРуках Расход
	Движения.КнигиНавРуках.Записывать = Истина;
	Для Каждого ТекСтрокаСписокКниг Из СписокКниг Цикл
		Движение = Движения.КнигиНавРуках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаСписокКниг.Книга;
		Движение.Читатель = Читатель;
		Движение.Выдал = Сотрудник;
		Движение.Количество = 1;
	КонецЦикла;
 	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ      
	
	 ОбработкаПроведенияПервая(Отказ, Режим)

КонецПроцедуры
